---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialWattageIntensity
source: html/2bcbaf81-375c-2732-d67a-563d8302cd1e.htm
---
# Autodesk.Revit.DB.Lighting.InitialWattageIntensity

This class encapsulates initial wattage intensity calculation.

## Syntax (C#)
```csharp
public class InitialWattageIntensity : InitialIntensity
```